notes/oct4/oct4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-05 Thu 09:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Encoding Intuitionistic Logic proofs</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Encoding Intuitionistic Logic proofs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d00a8d">1. Review</a>
<ul>
<li><a href="#org6faa652">1.1. Formulae</a></li>
<li><a href="#org02fe763">1.2. Being in a context</a></li>
<li><a href="#org8ba6e0e">1.3. Building proofs</a></li>
</ul>
</li>
<li><a href="#org21c20e5">2. Exercises</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4d00a8d" class="outline-2">
<h2 id="org4d00a8d"><span class="section-number-2">1.</span> Review</h2>
<div class="outline-text-2" id="text-1">
<p>
We've now begun encoding propositional logic proofs in Haskell. Doing this
involved a few steps, which we rehash here in turn.
</p>
</div>

<div id="outline-container-org6faa652" class="outline-3">
<h3 id="org6faa652"><span class="section-number-3">1.1.</span> Formulae</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We defined formulae using the standard way of defining a set of syntactic
objects in Haskell, i.e., in terms of an algebraic data type. Given a set of
atomic formulae
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Atom</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">P</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Q</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">R</span> <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>)
</pre>
</div>
<p>
we can define the set of all formulae as a data type <code>Form</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Form</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">At</span> <span style="color: #d3869b;">Atom</span>       <span style="color: #928374;">-- </span><span style="color: #928374;">atomic formulae</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">:/\</span> <span style="color: #d3869b;">Form</span> <span style="color: #928374;">-- </span><span style="color: #928374;">conjunctions</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">:\/</span> <span style="color: #d3869b;">Form</span> <span style="color: #928374;">-- </span><span style="color: #928374;">disjunctions</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">Form</span> <span style="color: #928374;">-- </span><span style="color: #928374;">implications</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Taut</span>          <span style="color: #928374;">-- </span><span style="color: #928374;">tautology</span>
          <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Contr</span>         <span style="color: #928374;">-- </span><span style="color: #928374;">contradiction</span>
     <span style="color: #fb4933;">deriving</span> (<span style="color: #d3869b;">Show</span>)
</pre>
</div>
<p>
For example, we represent the formula \(p ∧ q\) as the expression <code>At P :/\ At
   Q</code>, the formula \(p → q\) as <code>At P :-&gt; At Q</code>, the formula \(p ∨ (q → r)\) as <code>At P
   :\/ (At Q :-&gt; At R)</code>, and so on, all of these expressions being of type <code>Form</code>.
</p>
</div>
</div>

<div id="outline-container-org02fe763" class="outline-3">
<h3 id="org02fe763"><span class="section-number-3">1.2.</span> Being in a context</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Ultimately, we want to have a way of encoding judgments of the form \(Γ ⊢ φ\).
But before we get there, we need to go about encoding contexts \(Γ\), as well
as talk about what it means for some assumption \(x : φ\) to be <i>in</i> a context
\(Γ\).
</p>

<p>
As for contexts, we can encode them as an algebraic data type analogous to
lists:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Context</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Empty</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Cons</span> <span style="color: #d3869b;">Form</span> <span style="color: #d3869b;">Context</span>
</pre>
</div>
<p>
With contexts at hand, we can begin talking, <i>in Haskell</i>, about what it means
for some assumption to be in a context. In particular, we use the following
encoding of <i>ways of being in a context</i> as a generalized algebraic data type
(GADT):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">In</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Form</span>) (&#947; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Context</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">First</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; (<span style="color: #d3869b;">Cons</span> &#966; &#947;)
  <span style="color: #d3869b;">Next</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">In</span> &#966; (<span style="color: #d3869b;">Cons</span> &#968; &#947;)
</pre>
</div>
<p>
We have done a couple of novel things here, which require particular Haskell
language extensions. First, we've encoded the data type <code>In φ γ</code> as a GADT,
necessitating the following language extension, which should go at the top of
your Haskell file:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fe8019;">{-# LANGUAGE GADTs #-}</span>
</pre>
</div>
<p>
Second, we have begun using data types themselves, i.e., <code>Form</code> and <code>Context</code> as
the types of <i>parameters</i> of a new type constructor <code>In</code>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
Note that this is very different from how data types are usually
defined&#x2014;even data types like <code>List a</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">List</span> a <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Empty</span> <span style="color: #83a598;">|</span> <span style="color: #d3869b;">Cons</span> a (<span style="color: #d3869b;">List</span> a)
</pre>
</div>
<p>
Here, the <code>a</code> in <code>List a</code> is a <i>type</i> (specifically, it can be any type). But the <code>φ</code>
of <code>In φ γ</code> isn't a type; it's a <code>Form</code>! Similarly, the <code>γ</code> of <code>In φ γ</code> isn't a type
either; it's a <code>Context</code>! In order to allow not only types but <i>data</i> to serve as
the parameters of data types, we need to turn on two other language
extensions:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fe8019;">{-# LANGUAGE DataKinds #-}</span>
<span style="color: #fe8019;">{-# LANGUAGE KindSignatures #-}</span>
</pre>
</div>
<p>
The first language extension, <code>DataKinds</code>, allows data to be promoted to the
same level as types; i.e., so that it can serve as  the parameter of a type
constructor, for example, in the way that a formula <code>φ</code> can be the parameter of
the type constructor <code>In</code>. The second, <code>KindSignatures</code>, allows new data types to
be declared by annotating their parameters with what kind of data they should
be (e.g., <code>(φ :: Form)</code> and <code>(γ :: Context)</code> above).
</p>

<p>
Thus what the data type <code>In φ γ</code> encodes is a way of an <i>index</i> into some context
<code>γ</code> which correspond to an assumption of <code>φ</code>. For example, if you were to request
the type of <code>First</code> in your ghci repl, you would get
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> <span style="color: #d3869b;">:</span>t <span style="color: #d3869b;">First</span>
<span style="color: #d3869b;">First</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; (<span style="color: #d3869b;">Cons</span> &#966; &#947;)
</pre>
</div>
<p>
meaning that <code>First</code> just indexes the first element of the context <code>Cons φ γ</code>. If
you were to request the type of, e.g., <code>Next First</code>, you would get
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #83a598;">&gt;&gt;&gt;</span> <span style="color: #d3869b;">:</span>t <span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>
<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; (<span style="color: #d3869b;">Cons</span> &#968; (<span style="color: #d3869b;">Cons</span> &#966; &#947;))
</pre>
</div>
<p>
meaning that <code>Next First</code> indexes the second element of the context <code>Cons ψ
   (Cons φ γ)</code>. And so on. In other words, the data type <code>In φ γ</code> just gives us all
the possible ways that some formula <code>φ</code> could be in a context <code>γ</code>; i.e., by being
the first element, the second element, etc.
</p>
</div>
</div>

<div id="outline-container-org8ba6e0e" class="outline-3">
<h3 id="org8ba6e0e"><span class="section-number-3">1.3.</span> Building proofs</h3>
<div class="outline-text-3" id="text-1-3">
<p>
We can continue by declaring a data type to encode <i>proofs</i>. In general, the
constructors of this data type act as functions: they either take a way of
being in a context onto an axiom that crucially uses that way of being in a
context, or they take old proofs onto new proofs. In the former case, we are
simply encoding the axiom rule:
\[\frac{φ ∈ Γ}{Γ ⊢ φ}\mathtt{Ax}\]
or, translated into Haskell,
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Proof</span> (&#947; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Context</span>) (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Form</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Ax</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; &#966;
</pre>
</div>
<p>
In the latter case, we are encoding the rules of Intuitionistic Logic, e.g.,
\(∧\mathtt{I}\), \(∨\mathtt{E}\), etc. As we saw in class, we can continue the
declaration of <code>Proof γ φ</code> by encoding the rules \(∨\mathtt{I}_L\),
\(∨\mathtt{I}_R\), and \(∨\mathtt{E}\):
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Proof</span> (&#947; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Context</span>) (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Form</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Ax</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; &#966;
  <span style="color: #d3869b;">OrIntroL</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;)
  <span style="color: #d3869b;">OrIntroR</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; &#968; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;)
  <span style="color: #d3869b;">OrElim</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> (<span style="color: #d3869b;">Cons</span> &#966; &#947;) &#967; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> (<span style="color: #d3869b;">Cons</span> &#968; &#947;) &#967; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; &#967;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org21c20e5" class="outline-2">
<h2 id="org21c20e5"><span class="section-number-2">2.</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
<p>
Finish declaring <code>Proof γ φ</code>. That is, fill in the following types:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Proof</span> (&#947; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Context</span>) (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Form</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Ax</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">In</span> &#966; &#947; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; &#966;                  <span style="color: #928374;">-- </span><span style="color: #928374;">Ax</span>
  <span style="color: #d3869b;">OrIntroL</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; &#966; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;) <span style="color: #928374;">-- </span><span style="color: #928374;">&#8744;I_L</span>
  <span style="color: #d3869b;">OrIntroR</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; &#968; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;) <span style="color: #928374;">-- </span><span style="color: #928374;">&#8744;I_R</span>
  <span style="color: #d3869b;">OrElim</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Proof</span> &#947; (&#966; <span style="color: #d3869b;">:\/</span> &#968;) <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> (<span style="color: #d3869b;">Cons</span> &#966; &#947;) &#967; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> (<span style="color: #d3869b;">Cons</span> &#968; &#947;) &#967; <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Proof</span> &#947; &#967; <span style="color: #928374;">-- </span><span style="color: #928374;">&#8744;E</span>
  <span style="color: #d3869b;">AndIntro</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span>  <span style="color: #928374;">-- </span><span style="color: #928374;">&#8743;I</span>
  <span style="color: #d3869b;">AndElimL</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span>  <span style="color: #928374;">-- </span><span style="color: #928374;">&#8743;E_L</span>
  <span style="color: #d3869b;">AndElimR</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span>  <span style="color: #928374;">-- </span><span style="color: #928374;">&#8743;E_R</span>
  <span style="color: #d3869b;">ArrIntro</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span>  <span style="color: #928374;">-- </span><span style="color: #928374;">&#8594;I</span>
  <span style="color: #d3869b;">ArrElim</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span>   <span style="color: #928374;">-- </span><span style="color: #928374;">&#8594;E</span>
  <span style="color: #d3869b;">TautIntro</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span> <span style="color: #928374;">-- </span><span style="color: #928374;">&#8868;I</span>
  <span style="color: #d3869b;">ContrElim</span> <span style="color: #83a598;">::</span> <span style="color: #fb4933;">_</span> <span style="color: #928374;">-- </span><span style="color: #928374;">&#8869;E</span>
</pre>
</div>
<p>
Refer to <a href="https://juliangrove.github.io/ur-comp-sem-2023/notes/sept27/sept27.html#orge40b96e">the rules</a>!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Kinds, really:
<a href="https://ghc.gitlab.haskell.org/ghc/doc/users_guide/exts/data_kinds.html">https://ghc.gitlab.haskell.org/ghc/doc/users_guide/exts/data_kinds.html</a></p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-10-05 Thu 09:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>